FlipFromToRoom Method
 Flips the settings of "From Room" and "To Room" for the door or window instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void FlipFromToRoom()
Visual Basic
Public Sub FlipFromToRoom
Visual C++
public:
void FlipFromToRoom()
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when the FamilyInstance is neither a door nor a window.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →